

01. Which model of ROUTER and SWITCH, we use in Packet Tracer and 
    What are About Interface, Extensionibility, Module, Power and Configuration of these router and switch?
02. How to get extra FastEthernet or Serial port in Cisco Packet Tracer? what is the meaning of NM, WIC?
03. What is Serial and Parallel Interface?
04. What is Clock speed?
05. Types of Router/Switch Command.


01.
Router: 2811 and Switch: 2960

What is Cisco ROUTER 2811 ?
--------------------------
The Cisco 2811 Router supports multiple WAN interfaces as well as over 90 Cisco modules. 

What is a SWITCH 2960?
----------------------
Cisco 2960 Series Switches are 
-Fixed-configuration, 
-Standalone intelligent Ethernet devices with Power Over Ethernet (PoE) 
Non-PoE configurations that provide Desktop 
-Fast Ethernet and 
-Gigabit Ethernet connectivity, 
-Enhanced LAN services 
for entry-level enterprise, midmarket, and branch.


Get extra FastEthernet or Serial port in Cisco Packet Tracer:
------------------------------------------------------------
>Click on Router
>Than Physical

>Go to NM-2FE2W (For getting extra 2 FastEthernet)
>Go to WIC-27   (For getting extra 2 Serial Port)

NM: Network Analysis Module
WIC: WAN Interface Card


Router and Switch INTERFACE:
---------------------------
There are two type of interface:

01. Parallel Interface:
-----------------------
-High speed. 
-Cannot transmit data over long distances.

02. Serial Interface:
---------------------
-Can transmit data over long distances.
-Lower speed 
-Connect Router using the cable V.35 DTE and DCE cables.

CLOCK SPEED:
------------
The clock rate serves to synchronize the receiver on the other side of the link.
Each clock pulse signals the transmission of a bit.
Note that it is mainly used in lab setups. In the real world, network providers almost always deliver the clock signal.

Configuration:
router# conf t
router(config)# interface serial 1/0
router(config-if)# clock rate 64000 (represented in BITS per second)


05. Types of Router/Switch Command:
===================================
There are 4 types of Command:

01.A.User EXEC Commands:
-----------------------
Router> ping, show (limited), enable.

01.B. Privileged EXEC Commands/Router all User EXEC commands:
------------------------------------------------------------
Router(config)# debug commands
Router(config)#reload
Router(config)#configure (hostname , enable secret, ip route )

03. INTERFACE
-------------
Router(config-if)# interface ethernet(ip address, ipx address, encapsulation, shutdown / no shutdown)
Router(config-if)# serial
Router(config-if)# bri

04. ROUTER
-----------
Router(config-router)#router rip
Router(config-router)#router ospf
Router(config-router)#router igrp

Routing Engine Commands - 
Router(config-router)# network 
Router(config-router)# version 
Router(config-router)# auto-summary

04. LINE
--------
Router(config-line): vty 
Router(config-line): console

Line Commands - 
Router(config-line): password
Router(config-line): login 
Router(config-line): modem





