

TO CHECK:
--------
Switch>en   (enable switch)
Esc (return to main window)

Switch>show ip interface brief
Switch#sh int fa 0/1
Switch#sh int tr/show interface trunk   ( if TRUNK is avaiable)
Switch#sh vlan bri/brief

Switch#show ?  (all available command)



TO CREATE and CONFIGURE:
------------------------
Switch#config t                        (configure terminal)
Switch#hostname switch01
switch01(config)#exit                    (exit from config mode)

Switch(config)# int f 0/1              (interface fastEthernet)
Switch(config)# int range f 0/1-4

ACCESS PORT and VLAN:--
Switch(config-if)#switchport mode access      (create access port)

Switch(config)#vlan 10                 (create vlan)
Switch(config-vlan)#name HR            (create name)

Switch(config-if)#switchport access vlan 10(vlan access)   (assign a VLAN to access port)


Switch(config-if)# switchport mode trunk/dynamic/trunk
	
  *trunk	Set trunking mode to ACCESS unconditionally
  dynamic	Set trunking mode to dynamically negotiate trunk or trunk mode
  trunk	Set trunking mode to TRUNK unconditionally


ROUTER(STICK):
-------------
Router(config)#int f 0/0.1             (access imaginary Ethernet port)
Router(config-subif)#encapsulation dot1Q 20(Vlan No)
Router(config-subif)#ip address 192.168.20.1 255.255.255.0

TO DELETE VLAN and ACCESS:
--------------------------
Switch(config)# int f 0/1 	Enter in Interface configuration mode
Switch(config-if)#no switchport access vlan 10	Removes interface from VLAN 10 and reassigns it to the default VLAN â€“ VLAN 1
Switch(config)#no vlan 10	Delete VLAN 10 from VLAN database




