


Advantages and Disadvantages of VLAN:
-------------------------------------
Advantages to VLAN include reduced broadcast traffic, security, ease of administration and broadcast domain confinement.

However, a disadvantage of VLANs includes the limitation of 4,096 VLANs per switching domain creates problems for large hosting providers,
which often need to allocate tens or hundreds of VLANs for each customer. 

To address this limitation, other protocols, like The Spanning Tree Protocol (STP) is used to create loop-free topology, 
VXLAN(Virtual Extensible LAN), NVGRE (Network Virtualization using Generic Routing Encapsulation) 
and Geneve, support larger tags and the ability to tunnel Layer 2 frames within Layer 3 (network) packets.


Types of VLANs:
---------------
Types of VLANs include Protocol based, static and dynamic VLANs.
A Protocol VLAN- which has traffic handled based on its protocol. A switch will segregate or forward traffic based on the traffics protocol.  
Static VLAN- also referred to as port-based VLAN, needs a network administrator to assign the ports on a network switch to a virtual network; while:
Dynamic VLAN- allows a network administrator just to define network membership based on device characteristics, as opposed to switch port location.


Short-Code to configure interface:
----------------------------------
Tut: https://www.computernetworkingnotes.com/ccna-study-guide/configure-dhcp-server-for-multiple-vlans-on-the-switch.html


ROUTER/SWITCH:
--------------
en
config t
int fa 0/0
ip address 20.0.0.1 255.0.0.0

---------------------------
Switch>en   (enable switch)
Esc (return to main window)
Switch#show ?  (all available command)

TO CHECK: (interface/port,ip,vlan and trunk configuration)
-------------------------------------------------------
Switch>show ip interface brief
Switch>show interface status
Switch#sh int fa 0/1
Switch#sh int tr/show interface trunk   ( if TRUNK is avaiable)
Switch#sh vlan bri/brief


TO CREATE/CONFIGURE:
--------------------
Switch#config t                        (configure terminal)
Switch#hostname switch01
switch01(config)#exit                    (exit from config mode)

Switch(config)# int f 0/1              (interface fastEthernet)
Switch(config)# int range f 0/1-4

VLAN (CREATE/NAME) and CREATE ACCESS (PORT/TRUNK) and Assign PORT(to VLAN):
--------------------------------------------------------------------------
Switch(config)#vlan 10                 (create vlan)
Switch(config-vlan)#name HR            (create name)

Switch(config-if)#switchport mode access      (create access port)
Switch(config-if)# switchport mode trunk/dynamic/trunk	
  *trunk	Set trunking mode to ACCESS unconditionally
  dynamic	Set trunking mode to dynamically negotiate trunk or trunk mode
  trunk	Set trunking mode to TRUNK unconditionally

Switch(config-if)#switchport access vlan 10(vlan access)   (assign a VLAN to access port)

TO DELETE VLAN and ACCESS:
--------------------------
Switch(config)# int f 0/1 	(Enter in Interface configuration mode)
Switch(config-if)#no switchport access vlan 10	(Removes interface from VLAN 10 and reassigns it to the default VLAN â€“ VLAN 1)
Switch(config)#no vlan 10	 (Delete VLAN 10 from VLAN database)


----:ROUTER:---
VLAN CREATE and STICK In ROUTER:
-------------------------------
Router#vlan database
Router(vlan)#vlan 40 name SALES
Router#show vlan brief

Router(config)#int f 0/0.1             (can name anything ex: 0/0.10, imaginary Ethernet port)
Router(config-subif)#encapsulation dot1Q 20(Vlan No)
Router(config-subif)#ip address 192.168.20.1 255.255.255.0

Router(config)#int f 0/0
Router(config)#no shutdown / shutdown







