
ACCESS LAYER SWITCH SECURITY:
00. How to A) Check All Interface info.
01. What/Why is DHCP snooping and how to configure it?
02. What/Why is DAI (Dynamic ARP Inspection)?
03. What/Why is 802.1x Identity Based Networking?
04. Steps for PORT Security and configuration.
05. PORT SECURITY DEFAULT BEHAVIOUR?
06. Security Violation Actions?
07. ERROR DISABLED INTERFACE and AUTO RECOVARY?
08. How to ADD more than one MAC address Automaticlly and Manually to a switch port and  HOW to learn/show them?


=======0======
SW1#sh ip int brief



======================= 01 What is DHCP snooping and how to configure it? =====================

When DHCP Snooping is enabled, DHCP Server responses are dropped if they don’t arrive on a trusted port.

> When you enable DHCP snooping: the switch inspects the DHCP traffic and keeps track of which IP addresses were assigned to which MAC addresses
For example, PC1 with MAC address 1.1.1 was assigned IP address 10.10.10
> If invalid ARP traffic tries to pass through the switch, for example 3.3.3 saying it is 10.10.10, the switch drops the traffic

SW1(config)#ip dhcp snooping 
SW1(config)#ip dhcp snooping vlan 10 
SW1(config)#int f0/1 
SW1(config-if)#ip dhcp snooping trust


=================================02. What/Why is DAI (Dynamic ARP Inspection)? ==================================

ARP Request: IP address is used to get MAC address. Ex: I’m looking for 10.10.10.1, what’s your MAC address?
DAI is not performed on trusted ports. Enable this for non DHCP clients.

Configuration:
--------------
SW1(config)#int f0/1
SW1(config-if)#ip arp inspection trust!
SW1(config)#ip arp inspection vlan 10


==============================03. What/Why is 802.1x Identity Based Networking?================================

When 802.1X is enabled:
only authentication traffic is allowed on switch ports until the host and user are authenticated.
When the user has entered a valid username and password, the switch port transitions to a normal access port in the relevant VLAN.


=============================04. Steps for PORT Security ===================================

>>Best practice is to administratively shut down unused switch ports.
This stops somebody getting access to the network if they physically connect to the port
SW1(config)#int f0/2 
SW1(config-if)#shutdown

>> Port Security enables an administrator to specify which MAC address or addresses can send traffic in to an individual switch port.
This can be used to lock a port down to a particular host or hosts

>> It is easy to spoof a MAC address, so locking ports down to a specific host is not usually Port Security’s main role in production networks
Port Security can also configure individual switch ports to allow only a specified number of source MAC addresses to send traffic in to the port
It can learn connected MAC addresses

>> This is useful to prevent users from adding Wireless Access Points or other shared devices

Configuration:
--------------
SW1(config)#int f0/2
SW1(config-if)#switch mode access
SW1(config-if)#switchport port-security


============================ 05. PORT SECURITY DEFAULT BEHAVIOUR? ============================

> If you configure Port Security with no additional parameters then only one MAC address is allowed to transmit on the port
> The current MAC address can be disconnected and replaced. The port is not locked down to a particular MAC address
> If a shared device is connected and multiple hosts try to transmit the port will be shut down

Configuration:
--------------
SW1#show port-security interface f0/2


============================ 06. Security Violation Actions? ============================

You have 03 options when an unauthorised MAC address sends traffic in to the port:

01> Shutdown (Default): The interface is placed into the error-disabled state, blocking all traffic.
02> Protect:  Traffic from unauthorised addresses is dropped. Traffic from allowed addresses is forwarded.
03> Restrict: Traffic from unauthorised addresses is dropped, logged and the violation counter incremented. 
              Traffic from allowed addresses is forwarded.

Configuration:
-------------
SW1(config)#int f0/2
SW1(config-if)#switch mode access
SW1(config-if)# switchport port-security violation protect
SW1(config-if)# switchport port-security violation restrict


========================07. ERROR DISABLED INTERFACE and AUTO RECOVARY?============================

If the Violation Action is set to Shutdown and a violation occurs, the port will move to an error-disabled state
To bring an error-disabled interface back into service:
        >>Physically remove the host with the offending MAC address 
        >>Manually shutdown then no shutdown the interface

AUTO RECOVARY:
--------------
You can bring error disabled ports back into service automatically after they have been disabled for a configurable period of time (in seconds)
SW1(config)#errdisable recovery causepsecure-violation 
SW1(config)#errdisable recovery interval 600


============================ 08. How to add mora than one MAC address to switch port and how to do so?===================================

When Port Security is enabled the maximum number of MAC addresses allowed to send traffic into the interface is one by default.
This can be increased if multiple hosts share the port, for example an IP phone with a PC plugged into the back of it.

Configure:
----------
SW1(config)# interface f0/2
SW1(config-if)# switchport port-security maximum 2

Show:
SW1#show port-security int f0/2


Manually Adding MAC Addresse:
-----------------------------
You can statically configure allowed MAC addresses if you want to lock the port down to a particular host:

SW1(config)# interface f0/10
SW1(config-if)# switch mode access
SW1(config-if)# switchport port-security
SW1(config-if)# switchport port-security mac-address 1111.2222.3333
SW1(config-if)# switchport port-security maximum 1

MAC Address Learning:
---------------------
Scenario: You have 1000 authorised hosts connected to the network. You want to lock the ports down to these particular hosts
Manually adding the MAC addresses is not a scalable solution. Sticky MAC addresses add the learned MAC address to the running 
configuration. Save to the startup config to make them permanent.

Configure:
----------
SW1(config)# interface f0/2
SW1(config-if)#switch mode access
SW1(config-if)# switchport port-security
SW1(config-if)# switchport port-security mac-address sticky

SHOW: 
-----
SW# show port-security address
OR
SW# show port-security



